#
# CLI Tools
#------------------------------------------------------------------------------

brew 'ack'
brew 'awscli'
brew 'azure-cli'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'mysql' # Comes with mysqldump
brew 'php'
brew 'tfenv'
brew 'vim'
brew 'wget'

tap 'jenkins-x/jx'
brew 'jenkins-x/jx/jx'

#
# App Store
#------------------------------------------------------------------------------

brew 'mas'

mas '1Password', id: 1333542190
mas 'Amphetamine', id: 937984704
mas 'Divvy', id: 413857545
mas 'Final Cut Pro', id: 424389933
mas 'Magnet', id: 441258766
mas 'Messenger', id: 1480068668
mas 'Noizio', id: 928871589
mas 'Notability', id: 736189492
mas 'Remote Desktop', id: 409907375
mas 'WhatsApp', id: 1147396723

#
# Cask
#------------------------------------------------------------------------------

tap 'homebrew/cask-versions'
cask_args appdir: '/Applications'

# Drivers

tap 'homebrew/cask-drivers'
cask 'logitech-options'

# General Apps

cask 'alfred'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'path-finder'
cask 'the-unarchiver'
cask 'transmission'

# Work apps

cask 'adobe-acrobat-pro'
cask 'dropbox'
cask 'microsoft-office'

# Communication apps

cask 'microsoft-teams'
cask 'slack'
cask 'zoomus'

# Design apps

# ...

# Dev-related apps

cask 'bootstrap-studio'
cask 'dash'
cask 'firefox-developer-edition'
cask 'lando'
cask 'phpstorm'
cask 'sublime-text'
cask 'transmit'
