cask_args appdir: '/Applications'

cask 'adobe-creative-cloud'
cask 'anydesk'
cask 'clickup'
cask 'fontbase'
cask 'google-chrome'
cask 'keyboard-maestro'
cask 'skype'
cask 'slack'
cask 'transmission'
cask 'vlc'
cask 'zoomus'

brew 'mas'

mas '1Password', id: 1333542190
mas 'Keynote', id: 409183694
mas 'Notability', id: 736189492
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'The Unarchiver', id: 425424353
