brew 'ack'
brew 'awscli'
brew 'direnv'
brew 'fish'
brew 'git'
brew 'git-lfs'
brew 'htop'
brew 'jq'
brew 'ncdu'
brew 'p7zip'
brew 'php'
brew 'rsync'
brew 'tfenv'
brew 'tree'
brew 'vim'
brew 'wget'

tap 'kwilczynski/homebrew-pkenv'
brew 'pkenv'

tap 'TomAnthony/brews'
brew 'itermocil'

cask_args appdir: '/Applications'

cask 'dash'
cask 'insomnia'
cask 'iterm2'
cask 'kaleidoscope'
cask 'kitematic'
cask 'lando'
cask 'phpstorm'
cask 'sublime-merge'
cask 'sublime-text'
cask 'tableplus'
cask 'transmit'

tap 'homebrew/cask-versions'
cask 'firefox'

brew 'mas'
mas 'MCG', id: 799178412
