brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'composer'
brew 'coreutils'
brew 'direnv'
brew 'docker-compose'
brew 'fish'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'htop'
brew 'libiconv'
brew 'libtool'
brew 'libxml2'
brew 'mysql' # Need it for mysqldump
brew 'ncdu'
brew 'openssl'
brew 'php'
brew 'pkg-config'
brew 'readline'
brew 'rsync'
brew 'terraform'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zlib'

tap 'TomAnthony/brews'
brew 'itermocil'

cask_args appdir: '/Applications'

cask 'adobe-creative-cloud'
cask 'anydesk'
cask 'captain'
cask 'dash'
cask 'docker'
cask 'figma'
cask 'fontbase'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'keyboard-maestro'
cask 'kitematic'
cask 'microsoft-teams'
cask 'notion'
cask 'parallels'
cask 'path-finder'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text'
cask 'transmission'
cask 'transmit'
cask 'vlc'
cask 'zoomus'

tap 'homebrew/cask-versions'
cask 'firefox-developer-edition'

brew 'mas'
mas '1Password', id: 1333542190
mas 'Ambiance', id: 543361303
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'The Unarchiver', id: 425424353
mas 'Notability', id: 736189492
mas 'MCG', id: 799178412
