brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'coreutils'
brew 'direnv'
brew 'docker-compose'
brew 'fish'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'libtool'
brew 'mysql'
brew 'openssl'
brew 'pandoc'
brew 'pkg-config'
brew 'postgres@11.4'
brew 'readline'
brew 'rsync'
brew 'terraform'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zlib'

tap 'TomAnthony/brews'
brew 'itermocil'

cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'

cask 'adobe-creative-cloud'
cask 'captain'
cask 'cyberduck'
cask 'dash'
cask 'docker'
cask 'firefox-developer-edition'
cask 'fork'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'kaleidoscope'
cask 'keyboard-maestro'
cask 'kitematic'
cask 'microsoft-teams'
cask 'rubymine'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'transmission'
cask 'vlc'
cask 'yt-music'
cask 'zoomus'

cask 'qlcolorcode' # Enable syntax highlighting in source files
cask 'qlmarkdown' # Preview Markdown files
cask 'qlprettypatch' # diff/patch files
cask 'qlstephen' # Preview plain text files without extension
cask 'quicklook-json' # Preview json jiles

brew 'mas'
mas '1Password', id: 1333542190
mas 'Ambiance', id: 543361303
mas 'Keynote', id: 409183694
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Ambiance', id: 543361303
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'The Unarchiver', id: 425424353
